# schedule.py

schedule = {
    "Понедельник": """
⏰ 8.00-9.35 Лекция: Математическое моделирование технологических процессов и САПР. Доц. Рафальский И.В.

⏰ 9.55-11.30
1 нед. Лекция: Металловедение и термическая обработка металлов. Доц. Астрейко Л.А. а.426 к.8
2 нед. Практическое занятие: Технологическое оборудование литейных цехов. Доц. Довнар Г.В. а.36 к.7

⏰ 11.40-13.15
1 нед. Лабораторное занятие: Технология литейных форм. Доц. Барановский К.Э. а.04 к.7
2 нед. Лабораторное занятие: Металловедение и термическая обработка металлов. Доц. Астрейко Л.А. а.126 к.8

⏰ 13.55-15.30
1 нед. Лабораторное занятие: Технология литейных форм. Доц. Барановский К.Э. а.04 к.7
2 нед. Лабораторное занятие: Металловедение и термическая обработка металлов. Доц. Астрейко Л.А. а.126 к.8

⏰ 15.40-17.15
2 нед. Консультация по КП Металлургическая теплотехника и теплоэнергетика. Доц. Румянцева Г.А. а.15 к.7
""",
    "Вторник": """
⏰ 8.00-9.35 1 нед. Практическое занятие: Основы психологии и педагогики. Пр. Воровко О.В. а.210 к.12
⏰ 9.55-11.30
1 нед. Практическое занятие: Автоматизация технологических процессов. Доц. Бежок А.П. а.210 к.12
2 нед. Лекция: Автоматизация технологических процессов. Доц. Бежок А.П. а.210 к.12
⏰ 11.40-13.15 Лекция: Технологическое оборудование литейных цехов. Доц. Довнар Г.В. а.20 к.7
⏰ 13.55-15.30 Лабораторное занятие: Сварка, обработка металлов давлением и резаньем. Занковец П.В. а.03 к.7
""",
    "Среда": """
⏰ 9.55-11.30
2 нед. Лекция: Сварка, обработка металлов давлением и резаньем. Занковец П.В. а.210 к.12
1 нед. Консультация по КП Металлургическая теплотехника и теплоэнергетика. Доц. Румянцева Г.А. а.04 к.7

⏰ 11.40-13.15 Лекция: Металловедение и термическая обработка металлов. Доц. Астрейко Л.А. а.30 к.7
⏰ 13.55-15.30 Лекция: Экономика предприятия. Доц. Короткевич Л.М. а.341 к.1
⏰ 15.40-17.15 Лабораторное занятие: Математическое моделирование технологических процессов и САПР. Мацинова Д.И. а.34/6 к.7
""",
    "Четверг": """
⏰ 8.00-9.35 Физкультура. Ст.пр. Горальчук Е.В.
⏰ 9.55-11.30 Лекция: Сварка, обработка металлов давлением и резаньем. Занковец П.В. а.36 к.7
⏰ 11.40-13.15 Лекция: Технологическое оборудование литейных цехов. Доц. Довнар Г.В. а.36 к.7
⏰ 13.55-15.30 Лабораторное занятие: Сварка, обработка металлов давлением и резаньем. Занковец П.В. а.03 к.7
""",
    "Пятница": """
⏰ 8.00-9.35 Лекция: Автоматизация технологических процессов. Доц. Бежок А.П. а.28 к.7
⏰ 9.55-11.30 Лекция: Технология литейных форм. Доц. Барановский К.Э. а.15 к.7
⏰ 11.40-13.15 Практическое занятие: Технология литейных форм. Доц. Барановский К.Э. а.15 к.7
⏰ 13.55-15.30 Практическое занятие: Технология литейных форм. Доц. Барановский К.Э. а.15 к.7
⏰ 15.40-17.15 Лабораторное занятие: Математическое моделирование технологических процессов и САПР. Мацинова Д.И. а.34/6 к.7
""",
    "Суббота": """
⏰ 8.00-9.35 1 нед. Лекция: Основы психологии и педагогики. Доц. Пуйман С.А. а.446 к.1
⏰ 9.55-11.30 2 нед. Практическое занятие: Экономика предприятия. Журович А.С. а.443 к.1
"""
}
